Revit 2027 API
RebarFreeFormAccessor.SetLayoutAsMaximumSpacing Method
 Sets the Layout Rule property of rebar set to Maximum Spacing.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLayoutAsMaximumSpacing(
	double spacing
)
Public Sub SetLayoutAsMaximumSpacing (
	spacing As Double
)
public:
void SetLayoutAsMaximumSpacing(
	double spacing
)
member SetLayoutAsMaximumSpacing :
        spacing : float -> unit
Parameters
spacing Double
 The maximum spacing of bars in set.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The spacing isn't bigger than 0.0.
InvalidOperationException |  This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace